---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.VerticalExtent
source: html/d218fc23-3966-b79b-a863-8fdd74569dfe.htm
---
# Autodesk.Revit.DB.CameraInfo.VerticalExtent Property

Distance between top and bottom planes on the target plane.

## Syntax (C#)
```csharp
public double VerticalExtent { get; }
```